test1/Case1/system/controlDict
FoamFile
{
    version 2.0;
    format  ascii;
    class   dictionary;
    object  controlDict;
}

application     coatingPhaseFieldFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         1e-1;

deltaT          2e-6; //1e-4

writeControl    runTime;  
writeInterval   1e-3;

writeFormat      ascii;
//writeFormat     binary;
writeCompression off;
purgeWrite      0;