test1/Case1/system/blockMeshDict
FoamFile
{
    version 2.0;
    format  ascii;
    class   dictionary;
    object  blockMeshDict;
}
convertToMeters 1;

vertices
(
    // back (z = 0)
    (0      0      0)   // 0
    (0.026  0      0)   // 1
    (0.026  0.01   0)   // 2
    (0      0.01   0)   // 3

    // front (z = 1)  ← 任意厚度；empty 會忽略
    (0      0      0.001)   // 4
    (0.026  0      0.001)   // 5
    (0.026  0.01   0.001)   // 6
    (0      0.01   0.001)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (520 200 1) simpleGrading (1 1 1)
);

//edges ();

boundary
(
    borders
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

//mergePatchPairs ();
