test1/Case1/0/U.org
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0); 
boundaryField
{
    borders
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}