test1/Case1/system/fvSolution
FoamFile { 
    version 2.0;
    format ascii;
    class dictionary;
    object fvSolution; 
}

solvers
{
// Initial
  p
  {
    solver          GAMG;
    preconditioner  DIC;
    tolerance       1e-6;
    relTol          0;

    smoother                DICGaussSeidel;
    nPreSweeps              0;
    nPostSweeps             2;
    nFinestSweeps           2;
    cacheAgglomeration      true;
    nCellsInCoarsestLevel   10;
    agglomerator            faceAreaPair;
    mergeLevels             1;
  }
  U
  {
    solver          PBiCGStab;
    preconditioner  DILU;
    // solver          smoothSolver;  
    // smoother        symGaussSeidel;
    tolerance       1e-6;
    relTol          0;
  }
  fi
  {
    solver          PBiCGStab;
    preconditioner  DILU;
    // solver          smoothSolver;  
    // smoother        symGaussSeidel;
    tolerance       1e-6;
    relTol          0;
  }
  // Final
  pFinal
  {
    $p;    
    relTol 0;    
  }
  UFinal
  {
    $U;          
    relTol 0;       
  }
  fiFinal
  {
    $fi;          
    relTol 0;
  }
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;   // 網格若較差可設 2
    pRefCell        0;            // 若封閉域需設參考壓力
    pRefValue       0;
    residualControl // 自動停條件（可選）
    {
        p   1e-6;
        U   1e-6;
        fi  1e-6;
    }
}

relaxationFactors
{
	fields
	{
		p 0.3;
		pFinal 1;
	}
	equations
	{
		"(U|fi)"	0.7;
		"(U|fi)Final"	1;

	}
}
